@section('faq')
<div class="container faq__fon">
    <div class="faq__title">
        <h3>FAQ</h3>
        <p>Здесь ты найдёшь ответы на часто задаваемые вопросы о турнире</p>
    </div>
    <div class="faq__body">
        <div class="faq_block">
            <div class="faq_item">
                <div class="faq_question" onclick="toggleFaq(this)">
                    <span>Кто может принимать участие в кибертурнире?
                    </span>
                    <svg  class="arrow" width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M9.01246 13C8.11226 13 7.66144 14.0766 8.29798 14.7062C8.29798 14.7062 8.29797 14.7062 8.29798 14.7062L11.4273 17.8016C13.5829 19.9339 14.6607 21 16 21C17.3393 21 18.4171 19.9339 20.5727 17.8016L23.702 14.7062C24.3386 14.0766 23.8877 13 22.9875 13C22.7196 13 22.4625 13.1053 22.2731 13.2927L19.1437 16.3882C18.0255 17.4942 17.3276 18.1786 16.7544 18.6112C16.2371 19.0016 16.0565 19.0012 16.0028 19.001L16 19.001L15.9973 19.001C15.9435 19.0012 15.7629 19.0016 15.2456 18.6112C14.6724 18.1786 13.9745 17.4942 12.8563 16.3882L9.72695 13.2927C9.72695 13.2927 9.72695 13.2927 9.72695 13.2927C9.53745 13.1053 9.28044 13 9.01246 13Z" fill="#8D969F"/>
                        </svg>
                </div>
                <div class="faq_answer">
                    <p>В МТС Cyber Cup могут участвовать все сотрудники экосистемы МТС.</p>
                </div>
            </div>
            <div class="faq_item">
                <div class="faq_question" onclick="toggleFaq(this)">
                    <span>Какой формат соревнований?
                    </span>
                    <svg  class="arrow" width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M9.01246 13C8.11226 13 7.66144 14.0766 8.29798 14.7062C8.29798 14.7062 8.29797 14.7062 8.29798 14.7062L11.4273 17.8016C13.5829 19.9339 14.6607 21 16 21C17.3393 21 18.4171 19.9339 20.5727 17.8016L23.702 14.7062C24.3386 14.0766 23.8877 13 22.9875 13C22.7196 13 22.4625 13.1053 22.2731 13.2927L19.1437 16.3882C18.0255 17.4942 17.3276 18.1786 16.7544 18.6112C16.2371 19.0016 16.0565 19.0012 16.0028 19.001L16 19.001L15.9973 19.001C15.9435 19.0012 15.7629 19.0016 15.2456 18.6112C14.6724 18.1786 13.9745 17.4942 12.8563 16.3882L9.72695 13.2927C9.72695 13.2927 9.72695 13.2927 9.72695 13.2927C9.53745 13.1053 9.28044 13 9.01246 13Z" fill="#8D969F"/>
                        </svg>
                </div>
                <div class="faq_answer">
                    <p>В МТС Cyber Cup представлено шесть дисциплин: четыре в командном формате и две в индивидуальном. Командный формат — Counter-Strike 2, Dota 2, Квиз, Мир Танков. Индивидуальный формат — Своя игра и FIFA (FC24). 

                    </p>
                </div>
            </div>
            <div class="faq_item">
                <div class="faq_question" onclick="toggleFaq(this)">
                    <span>Сколько этапов на турнире?

                    </span>
                    <svg  class="arrow" width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M9.01246 13C8.11226 13 7.66144 14.0766 8.29798 14.7062C8.29798 14.7062 8.29797 14.7062 8.29798 14.7062L11.4273 17.8016C13.5829 19.9339 14.6607 21 16 21C17.3393 21 18.4171 19.9339 20.5727 17.8016L23.702 14.7062C24.3386 14.0766 23.8877 13 22.9875 13C22.7196 13 22.4625 13.1053 22.2731 13.2927L19.1437 16.3882C18.0255 17.4942 17.3276 18.1786 16.7544 18.6112C16.2371 19.0016 16.0565 19.0012 16.0028 19.001L16 19.001L15.9973 19.001C15.9435 19.0012 15.7629 19.0016 15.2456 18.6112C14.6724 18.1786 13.9745 17.4942 12.8563 16.3882L9.72695 13.2927C9.72695 13.2927 9.72695 13.2927 9.72695 13.2927C9.53745 13.1053 9.28044 13 9.01246 13Z" fill="#8D969F"/>
                        </svg>
                </div>
                <div class="faq_answer">
                    <p>На турнире три этапа: отборочный, групповой и финал. Более подробную информацию ты можешь найти в регламенте, который находится разделе Discord-сервера #регламент, а также по 
                        <a href="https://mtscybercup.ru/assets/doc/The%20rules%20of%20the%20MTC%20CYBER%20CUP%20tournament.pdf">ссылке</a>.
                    </p>
                </div>
            </div>
            <div class="faq_item">
                <div class="faq_question" onclick="toggleFaq(this)">
                    <span>Как и где будет проходить коммуникация с игроками?

                    </span>
                    <svg  class="arrow" width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M9.01246 13C8.11226 13 7.66144 14.0766 8.29798 14.7062C8.29798 14.7062 8.29797 14.7062 8.29798 14.7062L11.4273 17.8016C13.5829 19.9339 14.6607 21 16 21C17.3393 21 18.4171 19.9339 20.5727 17.8016L23.702 14.7062C24.3386 14.0766 23.8877 13 22.9875 13C22.7196 13 22.4625 13.1053 22.2731 13.2927L19.1437 16.3882C18.0255 17.4942 17.3276 18.1786 16.7544 18.6112C16.2371 19.0016 16.0565 19.0012 16.0028 19.001L16 19.001L15.9973 19.001C15.9435 19.0012 15.7629 19.0016 15.2456 18.6112C14.6724 18.1786 13.9745 17.4942 12.8563 16.3882L9.72695 13.2927C9.72695 13.2927 9.72695 13.2927 9.72695 13.2927C9.53745 13.1053 9.28044 13 9.01246 13Z" fill="#8D969F"/>
                        </svg>
                </div>
                <div class="faq_answer">
                    <p>Коммуникация с игроками будет проходить в Discord-сервере турнира. Также во время этапа регистрации организаторы создадут общий Telegram-чат и отдельные чаты для капитанов и команд. Обрати внимание, что эти инструменты не будут доступны с корпоративной сети МТС.  Поэтому воспользуйся мобильной или домашней сетью.

                    </p>
                </div>
            </div>
            <div class="faq_item">
                <div class="faq_question" onclick="toggleFaq(this)">
                    <span>У меня нет аккаунтов в Discord и Challonge. На какую почту мне их регистрировать?
                    </span>
                    <svg  class="arrow" width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M9.01246 13C8.11226 13 7.66144 14.0766 8.29798 14.7062C8.29798 14.7062 8.29797 14.7062 8.29798 14.7062L11.4273 17.8016C13.5829 19.9339 14.6607 21 16 21C17.3393 21 18.4171 19.9339 20.5727 17.8016L23.702 14.7062C24.3386 14.0766 23.8877 13 22.9875 13C22.7196 13 22.4625 13.1053 22.2731 13.2927L19.1437 16.3882C18.0255 17.4942 17.3276 18.1786 16.7544 18.6112C16.2371 19.0016 16.0565 19.0012 16.0028 19.001L16 19.001L15.9973 19.001C15.9435 19.0012 15.7629 19.0016 15.2456 18.6112C14.6724 18.1786 13.9745 17.4942 12.8563 16.3882L9.72695 13.2927C9.72695 13.2927 9.72695 13.2927 9.72695 13.2927C9.53745 13.1053 9.28044 13 9.01246 13Z" fill="#8D969F"/>
                        </svg>
                </div>
                <div class="faq_answer">
                    <p>Если у тебя нет аккаунта в сервисах (Discord, Challonge) — регистрируйся с помощью личной электронной почты.

                        </p>
                </div>
            </div>
            <div class="faq_item">
                <div class="faq_question" onclick="toggleFaq(this)">
                    <span>Какие устройства понадобятся для участия? </span>
                    <svg  class="arrow" width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M9.01246 13C8.11226 13 7.66144 14.0766 8.29798 14.7062C8.29798 14.7062 8.29797 14.7062 8.29798 14.7062L11.4273 17.8016C13.5829 19.9339 14.6607 21 16 21C17.3393 21 18.4171 19.9339 20.5727 17.8016L23.702 14.7062C24.3386 14.0766 23.8877 13 22.9875 13C22.7196 13 22.4625 13.1053 22.2731 13.2927L19.1437 16.3882C18.0255 17.4942 17.3276 18.1786 16.7544 18.6112C16.2371 19.0016 16.0565 19.0012 16.0028 19.001L16 19.001L15.9973 19.001C15.9435 19.0012 15.7629 19.0016 15.2456 18.6112C14.6724 18.1786 13.9745 17.4942 12.8563 16.3882L9.72695 13.2927C9.72695 13.2927 9.72695 13.2927 9.72695 13.2927C9.53745 13.1053 9.28044 13 9.01246 13Z" fill="#8D969F"/>
                        </svg>
                </div>
                <div class="faq_answer">
                    <p>Dota 2, Counter Strike 2, Мир Танков — PC.
                        Своя Игра, Квиз — PC, Mobile (Android, iOS).
                        FIFA (FC 24) — PC, PlayStation 5, PlayStation 4, Xbox One, Xbox Series X|S.
                        
                    </p>
                </div>
            </div>
            <div class="faq_item">
                <div class="faq_question" onclick="toggleFaq(this)">
                    <span>Что делать, если у меня нет команды, но я хочу участвовать в командной дисциплине? 

                    </span>
                    <svg  class="arrow" width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M9.01246 13C8.11226 13 7.66144 14.0766 8.29798 14.7062C8.29798 14.7062 8.29797 14.7062 8.29798 14.7062L11.4273 17.8016C13.5829 19.9339 14.6607 21 16 21C17.3393 21 18.4171 19.9339 20.5727 17.8016L23.702 14.7062C24.3386 14.0766 23.8877 13 22.9875 13C22.7196 13 22.4625 13.1053 22.2731 13.2927L19.1437 16.3882C18.0255 17.4942 17.3276 18.1786 16.7544 18.6112C16.2371 19.0016 16.0565 19.0012 16.0028 19.001L16 19.001L15.9973 19.001C15.9435 19.0012 15.7629 19.0016 15.2456 18.6112C14.6724 18.1786 13.9745 17.4942 12.8563 16.3882L9.72695 13.2927C9.72695 13.2927 9.72695 13.2927 9.72695 13.2927C9.53745 13.1053 9.28044 13 9.01246 13Z" fill="#8D969F"/>
                        </svg>
                </div>
                <div class="faq_answer">
                    <p>На сайте турнира есть возможность зарегистрироваться индивидуально на командные дисциплины. Если ты регистрируешься как одиночный игрок, ты всё равно будешь играть в команде. С поиском команды тебе поможет раздел #поиск-команды на Discord-сервере турнира.

                    </p>
                </div>
            </div>
            <div class="faq_item">
                <div class="faq_question" onclick="toggleFaq(this)">
                    <span>Как будет формироваться турнирная сетка по итогам регистраций?
                    </span>
                    <svg  class="arrow" width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M9.01246 13C8.11226 13 7.66144 14.0766 8.29798 14.7062C8.29798 14.7062 8.29797 14.7062 8.29798 14.7062L11.4273 17.8016C13.5829 19.9339 14.6607 21 16 21C17.3393 21 18.4171 19.9339 20.5727 17.8016L23.702 14.7062C24.3386 14.0766 23.8877 13 22.9875 13C22.7196 13 22.4625 13.1053 22.2731 13.2927L19.1437 16.3882C18.0255 17.4942 17.3276 18.1786 16.7544 18.6112C16.2371 19.0016 16.0565 19.0012 16.0028 19.001L16 19.001L15.9973 19.001C15.9435 19.0012 15.7629 19.0016 15.2456 18.6112C14.6724 18.1786 13.9745 17.4942 12.8563 16.3882L9.72695 13.2927C9.72695 13.2927 9.72695 13.2927 9.72695 13.2927C9.53745 13.1053 9.28044 13 9.01246 13Z" fill="#8D969F"/>
                        </svg>
                </div>
                <div class="faq_answer">
                    <p>Турнирная сетка будет формироваться судьями 26-27 сентября. На период отборочных этапов команды будут делиться на дивизионы по регионам и часовым поясам. Это поможет минимизировать задержку в игре для участников, а также избавиться от проблемы с большой разницей во времени.

                    </p>
                </div>
            </div>
            <div class="faq_item">
                <div class="faq_question" onclick="toggleFaq(this)">
                    <span>В какое время будут проходить игры? 
                    </span>
                    <svg  class="arrow" width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M9.01246 13C8.11226 13 7.66144 14.0766 8.29798 14.7062C8.29798 14.7062 8.29797 14.7062 8.29798 14.7062L11.4273 17.8016C13.5829 19.9339 14.6607 21 16 21C17.3393 21 18.4171 19.9339 20.5727 17.8016L23.702 14.7062C24.3386 14.0766 23.8877 13 22.9875 13C22.7196 13 22.4625 13.1053 22.2731 13.2927L19.1437 16.3882C18.0255 17.4942 17.3276 18.1786 16.7544 18.6112C16.2371 19.0016 16.0565 19.0012 16.0028 19.001L16 19.001L15.9973 19.001C15.9435 19.0012 15.7629 19.0016 15.2456 18.6112C14.6724 18.1786 13.9745 17.4942 12.8563 16.3882L9.72695 13.2927C9.72695 13.2927 9.72695 13.2927 9.72695 13.2927C9.53745 13.1053 9.28044 13 9.01246 13Z" fill="#8D969F"/>
                        </svg>
                </div>
                <div class="faq_answer">
                    <p>Игры будут проходить после рабочего времени и на выходных
                    </p>
                </div>
            </div>
            <div class="faq_item">
                <div class="faq_question" onclick="toggleFaq(this)">
                    <span>Где пройдёт очный финал?
                    </span>
                    <svg  class="arrow" width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M9.01246 13C8.11226 13 7.66144 14.0766 8.29798 14.7062C8.29798 14.7062 8.29797 14.7062 8.29798 14.7062L11.4273 17.8016C13.5829 19.9339 14.6607 21 16 21C17.3393 21 18.4171 19.9339 20.5727 17.8016L23.702 14.7062C24.3386 14.0766 23.8877 13 22.9875 13C22.7196 13 22.4625 13.1053 22.2731 13.2927L19.1437 16.3882C18.0255 17.4942 17.3276 18.1786 16.7544 18.6112C16.2371 19.0016 16.0565 19.0012 16.0028 19.001L16 19.001L15.9973 19.001C15.9435 19.0012 15.7629 19.0016 15.2456 18.6112C14.6724 18.1786 13.9745 17.4942 12.8563 16.3882L9.72695 13.2927C9.72695 13.2927 9.72695 13.2927 9.72695 13.2927C9.53745 13.1053 9.28044 13 9.01246 13Z" fill="#8D969F"/>
                        </svg>
                </div>
                <div class="faq_answer">
                    <p>Очный финал пройдет в Москве. В нём примут участие финалисты и полуфиналисты по всем шести дисциплинам.
                    </p>
                </div>
            </div>
           
            <div class="faq_item">
                <div class="faq_question" onclick="toggleFaq(this)">
                    <span>Как будут оформляться командировки на финал?
                    </span>
                    <svg  class="arrow" width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M9.01246 13C8.11226 13 7.66144 14.0766 8.29798 14.7062C8.29798 14.7062 8.29797 14.7062 8.29798 14.7062L11.4273 17.8016C13.5829 19.9339 14.6607 21 16 21C17.3393 21 18.4171 19.9339 20.5727 17.8016L23.702 14.7062C24.3386 14.0766 23.8877 13 22.9875 13C22.7196 13 22.4625 13.1053 22.2731 13.2927L19.1437 16.3882C18.0255 17.4942 17.3276 18.1786 16.7544 18.6112C16.2371 19.0016 16.0565 19.0012 16.0028 19.001L16 19.001L15.9973 19.001C15.9435 19.0012 15.7629 19.0016 15.2456 18.6112C14.6724 18.1786 13.9745 17.4942 12.8563 16.3882L9.72695 13.2927C9.72695 13.2927 9.72695 13.2927 9.72695 13.2927C9.53745 13.1053 9.28044 13 9.01246 13Z" fill="#8D969F"/>
                        </svg>
                </div>
                <div class="faq_answer">
                    <p>Командировки будут оплачиваться за счёт компании. Подробности сообщим позднее.
                    </p>
                </div>
            </div>
        </div>
    </div>
</div>
<script>
    function toggleFaq(element) {
    const faqItem = element.parentElement;
    // Убираем класс "active" у всех элементов
    document.querySelectorAll('.faq_item').forEach(item => {
        if (item !== faqItem) {
            item.classList.remove('active');
        }
    });
    // Переключаем класс "active" для текущего элемента
    faqItem.classList.toggle('active');
}
</script>
@endsection
